<a href="https://colab.research.google.com/github/Dewinna/C--/blob/master/Occupancy_Classification_Exploration.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

#Occupancy Classification Data

##Part 1: Import Data
---

In [5]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import math

url = 'https://raw.githubusercontent.com/ansunsujoe/senior-design-project/master/OccupancyData.csv?token=AKSBURPANORJYNTPF6SVUIS7MUFFY'
df1 = pd.read_csv(url)
df1.head()

             date  Temperature  Humidity  ...         CO2  HumidityRatio  Occupancy
0  2/2/2015 14:19      23.7000    26.272  ...  749.200000       0.004764          1
1  2/2/2015 14:19      23.7180    26.290  ...  760.400000       0.004773          1
2  2/2/2015 14:21      23.7300    26.230  ...  769.666667       0.004765          1
3  2/2/2015 14:22      23.7225    26.125  ...  774.750000       0.004744          1
4  2/2/2015 14:23      23.7540    26.200  ...  779.000000       0.004767          1

[5 rows x 7 columns]

##Part 2: